The xs() method of DataFrame additionally takes a level argument to make selecting data at a particular level of a MultiIndex easier.

In [2]:
import numpy as np
import pandas as pd

In [9]:
arrays = [['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
          ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]
tuples = list(zip(*arrays))
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(3, 8), index=['A', 'B', 'C'], columns=index)

In [10]:
df = df.T

In [11]:
df

                     A         B         C
first second
bar   one    -0.160649  0.285755 -1.343684
      two     1.229970 -0.325956 -0.568354
baz   one     0.130929  1.280291 -0.488417
      two     1.633594  1.696567  0.937798
foo   one    -0.188400 -2.106296  2.134272
      two    -0.808827  0.237747 -2.019417
qux   one     0.007839  1.063960 -0.601109
      two     0.275263  1.025215 -1.901202

In [12]:
df.xs('one', level='second')

              A         B         C
first
bar   -0.160649  0.285755 -1.343684
baz    0.130929  1.280291 -0.488417
foo   -0.188400 -2.106296  2.134272
qux    0.007839  1.063960 -0.601109

In [13]:
# using the slicers
df.loc[(slice(None), 'one'), :]

                     A         B         C
first second
bar   one    -0.160649  0.285755 -1.343684
baz   one     0.130929  1.280291 -0.488417
foo   one    -0.188400 -2.106296  2.134272
qux   one     0.007839  1.063960 -0.601109

In [14]:
df = df.T

In [15]:
df

first        bar                 baz                 foo                 qux  \
second       one       two       one       two       one       two       one
A      -0.160649  1.229970  0.130929  1.633594 -0.188400 -0.808827  0.007839
B       0.285755 -0.325956  1.280291  1.696567 -2.106296  0.237747  1.063960
C      -1.343684 -0.568354 -0.488417  0.937798  2.134272 -2.019417 -0.601109

first
second       two
A       0.275263
B       1.025215
C      -1.901202

In [16]:
df.xs('one', level='second', axis=1)

first       bar       baz       foo       qux
A     -0.160649  0.130929 -0.188400  0.007839
B      0.285755  1.280291 -2.106296  1.063960
C     -1.343684 -0.488417  2.134272 -0.601109

In [17]:
# using the slicers
df.loc[:, (slice(None), 'one')]

first        bar       baz       foo       qux
second       one       one       one       one
A      -0.160649  0.130929 -0.188400  0.007839
B       0.285755  1.280291 -2.106296  1.063960
C      -1.343684 -0.488417  2.134272 -0.601109

In [ ]:
# xs also allows selection with multiple keys.

In [18]:
df.xs(('one', 'bar'), level=('second', 'first'), axis=1)

first        bar
second       one
A      -0.160649
B       0.285755
C      -1.343684

In [19]:
df.loc[:, ('bar', 'one')]

A   -0.160649
B    0.285755
C   -1.343684
Name: (bar, one), dtype: float64